questions = {
    "Классические напитки": {
        "Выбери верный ТТК на американо S": {
            "эспрессо 45мл, вода 160мл": False,
            "эспрессо 30мл, вода 150мл": False,
            "эспрессо 45мл, вода 150мл": True
        },
        "Выбери верный ТТК на американо M": {
            "эспрессо 60мл, вода 250мл": False,
            "эспрессо 70мл, вода 240мл": False,
            "эспрессо 60мл, вода 240мл": True
        },
        "Выбери верный ТТК на американо L": {
            "эспрессо 90мл, вода 310мл": False,
            "эспрессо 70мл, вода 300мл": False,
            "эспрессо 90мл, вода 300мл": True
        },
        "Выбери верный ТТК на капучино S": {
            "эспрессо 30мл, молоко 190мл": False,
            "эспрессо 45мл, молоко 175мл": False,
            "эспрессо 30мл, молоко 175мл": True
        },
        "Выбери верный ТТК на капучино M": {
            "эспрессо 60мл, молоко 260мл": False,
            "эспрессо 45мл, молоко 275мл": False,
            "эспрессо 60мл, молоко 275мл": True
        },
        "Выбери верный ТТК на капучино L": {
            "эспрессо 60мл, молоко 350мл": False,
            "эспрессо 70мл, молоко 375мл": False,
            "эспрессо 70мл, молоко 350мл": True
        },
        "Выбери верный ТТК на капучино XL": {
            "эспрессо 70мл, молоко 415мл": False,
            "эспрессо 90мл, молоко 450мл": False,
            "эспрессо 90мл, молоко 415мл": True
        },
        "Выбери верный ТТК на айс капучино M": {
            "эсп 60мл, мол 250мл, лёд 90": False,
            "эсп 30мл, мол 250мл, лёд 70": False,
            "эсп 60мл, мол 250мл, лёд 70": True
        },
        "Выбери верный ТТК на айс капучино L": {
            "эсп 90мл, мол 310мл, лёд 90": False,
            "эсп 70мл, мол 310мл, лёд 130": False,
            "эсп 70мл, мол 310мл, лёд 90": True
        },
        "Выбери верный ТТК на айс капучино XL": {
            "эсп 70мл, мол 400мл, лёд 120": False,
            "эсп 90мл, мол 370мл, лёд 120": False,
            "эсп 90мл, мол 400мл, лёд 120": True
        },
        "Выбери верный ТТК на айс латте М": {
            "эсп 45мл, мол 250мл, лёд 70": False,
            "эсп 30мл, мол 250мл, лёд 80": False,
            "эсп 30мл, мол 250мл, лёд 70": True
        },
        "Выбери верный ТТК на айс латте L": {
            "эсп 60мл, мол 310мл, лёд 120": False,
            "эсп 70мл, мол 310мл, лёд 90": False,
            "эсп 60мл, мол 310мл, лёд 90": True
        },
        "Выбери верный ТТК на айс латте XL": {
            "эсп 60мл, мол 370мл, лёд 120": False,
            "эсп 90мл, мол 400мл, лёд 120": False,
            "эсп 70мл, мол 400мл, лёд 120": True
        },
        "Сколько ванильного  сахара идёт в классический раф": {
            "20/30/40": False,
            "15/25/35": False,
            "10/20/30": True
        },
        "Выбери верный ТТК на классический раф с сиропом М": {
            "эспр 30, молоко и сливки 160,cироп 20": False,
            "эспр 45, молоко и сливки 130,cироп 20": False,
            "эспр 30, молоко и сливки 130,cироп 20": True
        },
        "Выбери верный ТТК на классический раф с сиропом L": {
            "эспр 70, молоко и сливки 175,cироп 30": False,
            "эспр 60, молоко и сливки 175,cироп 35": False,
            "эспр 60, молоко и сливки 175,cироп 30": True
        },
        "Выбери верный ТТК на классический раф с сиропом XL": {
            "эспр 90, молоко и сливки 225,cироп 40": False,
            "эспр 70, молоко и сливки 200,cироп 40": False,
            "эспр 70, молоко и сливки 225,cироп 40": True
        },
        "Выбери верный ТТК на айс раф с сиропом М": {
            "эспр 30, мол и слив 130, cир 20, лёд 70": False,
            "эспр 30, мол и слив 100, cир 20, лёд 80": False,
            "эспр 30, мол и слив 100, cир 20, лёд 70": True
        },
        "Выбери верный ТТК на айс раф с сиропом L": {
            "эспр 70, мол и слив 150, cир 30, лёд 90": False,
            "эспр 60, мол и слив 150, cир 30, лёд 80": False,
            "эспр 60, мол и слив 150, cир 30, лёд 90": True
        },
        "Выбери верный ТТК на айс раф с сиропом XL": {
            "эспр 70, мол и слив 200, cир 35, лёд 120": False,
            "эспр 90, мол и слив 200, cир 40, лёд 120": False,
            "эспр 70, мол и слив 200, cир 40, лёд 120": True
        },
        "Сколько топпинга идёт на мокачино ?": {
            "10/20/30/40": False,
            "25/25/35/45": False,
            "20/30/40/50": True
        },
        "Выбери верный ТТК на флет уайт S": {
            "эспрессо 45, молоко 175": False,
            "эспрессо 60, молоко 150": False,
            "эспрессо 60, молоко 175": True
        },
        "Выбери верный ТТК на флет уайт M": {
            "эспрессо 90, молоко 275": False,
            "эспрессо 70, молоко 250": False,
            "эспрессо 90, молоко 250": True
        },
        "Выбери верный ТТК на флет уайт L": {
            "эспрессо 90, молоко 300": False,
            "эспрессо 120, молоко 275": False,
            "эспрессо 120, молоко 300": True
        },
        "Выбери верный ТТК на лайкфраппе M": {
            "эспр 30, молоко 200, лёд 50, сироп 20": False,
            "эспр 60, молоко 200, лёд 50, сироп 30": False,
            "эспр 30, молоко 200, лёд 50, сироп 30": True
        },
        "Выбери верный ТТК на лайкфраппе L": {
            "эспр 60, молоко 275, лёд 65, сироп 35": False,
            "эспр 70, молоко 230, лёд 50, сироп 35": False,
            "эспр 60, молоко 230, лёд 65, сироп 35": True
        },
        "Выбери верный ТТК на лайкфраппе XL": {
            "эспр 90, молоко 250, лёд 80, сироп 40": False,
            "эспр 70, молоко 260, лёд 85, сироп 40": False,
            "эспр 70, молоко 250, лёд 80, сироп 40": True
        },
        "Выбери верный ТТК на какао S": {
            "молоко 190, молочный шоколад 40": False,
            "молоко 200, молочный шоколад 40": False,
            "молоко 190, молочный шоколад 35": True
        },
        "Выбери верный ТТК на какао M": {
            "молоко 300, молочный шоколад 50": False,
            "молоко 290, молочный шоколад 45": False,
            "молоко 290, молочный шоколад 50": True
        },
        "Выбери верный ТТК на какао L": {
            "молоко 400, молочный шоколад 70": False,
            "молоко 390, молочный шоколад 65": False,
            "молоко 390, молочный шоколад 70": True
        },
        "Выбери верный ТТК на какао XL": {
            "молоко 500, молочный шоколад 85": False,
            "молоко 490, молочный шоколад 80": False,
            "молоко 490, молочный шоколад 85": True
        },
        "Отличается ли по граммовкам ТТК на горячий шоколад и какао ?": {
            "Да": False,
            "Нет": True
        },
        "Выбери верный ТТК на зеленый чай из классики L": {
            "Горячая вода 320, холодная 80": False,
            "Горячая вода 300, холодная 100": False,
            "Горячая вода 300, холодная 80": True
        },
        "Сколько горячей воды идёт в чёрный чай из классики L": {
            "380": False,
            "450": False,
            "400": True
        },
        "Сколько молока идёт на матча-латте": {
            "200/300": False,
            "250/350": False,
            "230/330": True
        },
        "Сколько горячей воды идёт на матча-латте": {
            "50/70": False,
            "80/100": False,
            "70/90": True
        },
        "Сколько матчи идёт на матча-латте": {
            "2/3": False,
            "4/5": False,
            "3/4": True
        },
        "Сколько сиропа идёт на матча-латте": {
            "10/20": False,
            "15/25": False,
            "20/30": True
        },
    },
    "Фирменные напитки": {
        "Выбери верный ТТК на капучино круасан с кленовым сиропом и грецким орехом М": {
            "эспр 30, молоко 260, топпинг 30, пос 1": False,
            "эспр 30, молоко 275, топпинг 35, пос 0.5": False,
            "эспр 30, молоко 260, топпинг 35, пос 0.5": True
        },
        "Выбери верный ТТК на капучино круасан с кленовым сиропом и грецким орехом L": {
            "эспр 60, молоко 350, топпинг 45, пос 0.5": False,
            "эспр 60, молоко 330, топпинг 40, пос 0.5": False,
            "эспр 60, молоко 330, топпинг 45, пос 0.5": True
        },
        "Выбери верный ТТК на латте банановое мороженное с соленой карамелью М": {
            "эспр 30, молоко 260, осн 30, марш 10": False,
            "эспр 30, молоко 275, осн 25, марш 10": False,
            "эспр 30, молоко 260, осн 25, марш 10": True
        },
        "Выбери верный ТТК на латте банановое мороженное с соленой карамелью L": {
            "эспр 60, молоко 330, осн 40, марш 10": False,
            "эспр 60, молоко 350, осн 35, марш 10": False,
            "эспр 60, молоко 330, осн 35, марш 10": True
        },
        "Выбери верный ТТК на раф малина-кокос М": {
            "эспр 30, молоко 260, осн 30, пос 0.5": False,
            "эспр 30, молоко 260, осн 25, пос 1": False,
            "эспр 30, молоко 260, осн 25, пос 0.5": True
        },
        "Выбери верный ТТК на раф малина-кокос L": {
            "эспр 60, молоко 330, осн 30, пос 0.5": False,
            "эспр 60, молоко 330, осн 40, пос 0.5": False,
            "эспр 60, молоко 330, осн 35, пос 0.5": True
        },
        "Выбери верный ТТК на раф птичье молоко М": {
            "эспр 30, молоко 260, осн 30, пос 0.5": False,
            "эспр 30, молоко 260, осн 25, пос 1": False,
            "эспр 30, молоко 260, осн 25, пос 0.5": True
        },
        "Выбери верный ТТК на раф птичье молоко L": {
            "эспр 60, молоко 330, осн 30, пос 0.5": False,
            "эспр 60, молоко 330, осн 40, пос 0.5": False,
            "эспр 60, молоко 330, осн 35, пос 0.5": True
        },
        "Выбери верный ТТК на мокачино апельсиновый брауни М": {
            "эспр 30, молоко 260, осн 15, пос 0.5": False,
            "эспр 30, молоко 260, осн 13, пос 1": False,
            "эспр 30, молоко 260, осн 10, пос 0.5": True
        },
        "Выбери верный ТТК на мокачино апельсиновый брауни L": {
            "эспр 60, молоко 330, осн 20, пос 0.5": False,
            "эспр 60, молоко 330, осн 15, пос 0.5": False,
            "эспр 60, молоко 330, осн 13, пос 0.5": True
        },
        "Какая посыпка идёт в раф малина кокос": {
            "клубника": False,
            "кокос": False,
            "малина": True
        },
        "Какая посыпка идёт в раф птичье молоко": {
            "птичье молоко": False,
            "какао": False,
            "шоколад": True
        },
        "Какая посыпка идёт в мокачино апельсиновый брауни": {
            "апельсин": False,
            "шоколад": False,
            "брауни-лайм": True
        },
        "Какая посыпка идёт в капучино круасан с кленовым сиропом и грецким орехом": {
            "грецкий орех": False,
            "кленовый орех": False,
            "кориандр": True
        },
    },
    "Авторские чаи": {
        "Выбери общий ТТК на все горячие чёрные чаи М (пакетик идёт по умолчанию)": {
            "вода 300, основа 40": False,
            "вода 320, основа 45": False,
            "вода 300, основа 50": True
        },
        "Выбери общий ТТК на все горячие чёрные чаи L (пакетик идёт по умолчанию)": {
            "вода 380, основа 70": False,
            "вода 400, основа 60": False,
            "вода 380, основа 65": True
        },
        "Выбери общий ТТК на все горячие зелёные чаи M (пакетик идёт по умолчанию)": {
            "вода гор 200, вода хол 100, осн 40": False,
            "вода гор 220, вода хол 80, осн 50": False,
            "вода гор 240, вода хол 60, осн 50": True
        },
        "Выбери общий ТТК на все горячие зелёные чаи L (пакетик идёт по умолчанию)": {
            "вода гор 300, вода хол 100, осн 55": False,
            "вода гор 280, вода хол 120, осн 65": False,
            "вода гор 300, вода хол 80, осн 65": True
        },
        "Выбери общий ТТК на все холодные чаи M (пакетик идёт по умолчанию)": {
            "вода горяч и холод 100, осн 50, лёд 130": False,
            "вода горяч и холод 110, осн 50, лёд 150": False,
            "вода горяч и холод 100, осн 50, лёд 150": True
        },
        "Выбери общий ТТК на все холодные чаи L (пакетик идёт по умолчанию)": {
            "вода горяч и холод 125, осн 65, лёд 130": False,
            "вода горяч и холод 125, осн 70, лёд 150": False,
            "вода горяч и холод 125, осн 65, лёд 150": True
        },
        "Какого авторского чая нет в меню ?": {
            "Облепиха с апельcином и имбирём": False,
            "Малина с клюквой и барбарисом": False,
            "Манго с жасмином и каффир-лаймом": False,
            "Матча-латте": True,
        },
    },
    "Осень-зима 23/24": {
        "Выбери верный ТТК на капучино клубника с виноградом и бадьяном М": {
            "эсп 30, мол 275, осн 15, пос 0.5": False,
            "эсп 45, мол 260, осн 15, пос 0.5": False,
            "эсп 30, мол 260, осн 15, пос 0.5": True
        },
        "Выбери верный ТТК на капучино клубника с виноградом и бадьяном L": {
            "эсп 60, мол 350, осн 20, пос 0.5": False,
            "эсп 60, мол 330, осн 25, пос 0.5": False,
            "эсп 60, мол 330, осн 20, пос 0.5": True
        },
        "Выбери верный ТТК на капучино клубника с виноградом и бадьяном XL": {
            "эсп 70, мол 370, осн 25, пос 0.5": False,
            "эсп 70, мол 415, осн 23, пос 0.5": False,
            "эсп 70, мол 370, осн 23, пос 0.5": True
        },
        "Выбери верный ТТК на латте персик с кумкватом и песочным печеньем М": {
            "эсп 30, мол 275, осн 30, пос 0.5": False,
            "эсп 30, мол 260, осн 30, пос 0.5": False,
            "эсп 30, мол 260, осн 25, пос 0.5": True
        },
        "Выбери верный ТТК на латте персик с кумкватом и песочным печеньем L": {
            "эсп 60, мол 330, осн 40, пос 0.5": False,
            "эсп 60, мол 330, осн 35, пос 1": False,
            "эсп 60, мол 330, осн 35, пос 0.5": True
        },
        "Выбери верный ТТК на латте персик с кумкватом и песочным печеньем XL": {
            "эсп 70, мол 370, осн 45, пос 0.5": False,
            "эсп 70, мол 415, осн 40, пос 0.5": False,
            "эсп 70, мол 370, осн 40, пос 0.5": True
        },
        "Выбери верный ТТК на раф с фисташкой, рикоттой и клюквой M": {
            "эсп 30, мол 275, осн 25, пос 0.5": False,
            "эсп 30, мол 260, осн 30, пос 0.5": False,
            "эсп 30, мол 260, осн 25, пос 0.5": True
        },
        "Выбери верный ТТК на раф с фисташкой, рикоттой и клюквой L": {
            "эсп 60, мол 350, осн 35, пос 0.5": False,
            "эсп 60, мол 330, осн 40, пос 0.5": False,
            "эсп 60, мол 330, осн 35, пос 0.5": True
        },
        "Выбери верный ТТК на раф с фисташкой, рикоттой и клюквой XL": {
            "эсп 70, мол 415, осн 40, пос 0.5": False,
            "эсп 70, мол 370, осн 40, пос 1": False,
            "эсп 70, мол 370, осн 40, пос 0.5": True
        },
        "Выбери верный ТТК на глинтвейн апельсин с грейпфрутом и пряностями М": {
            "Сок и вода 150, основа 45": False,
            "Сок и вода 200, основа 40": False,
            "Сок и вода 150, основа 40": True
        },
        "Выбери верный ТТК на глинтвейн апельсин с грейпфрутом и пряностями L": {
            "Сок и вода 190, основа 50": False,
            "Сок и вода 200, основа 55": False,
            "Сок и вода 200, основа 50": True
        },
        "Выбери верный ТТК на глинтвейн апельсин с грейпфрутом и пряностями XL": {
            "Сок и вода 300, основа 60": False,
            "Сок и вода 250, основа 55": False,
            "Сок и вода 250, основа 60": True
        },
    },
    "Детское меню": {
        "Какого объёма есть напитки в детском меню ?": {
            "S/M/L": False,
            "только S": False,
            "S/M": True
        },
        "Сколько зефирок идёт на украшения в детском меню ?": {
            "15": False,
            "20": False,
            "10": True
        },
        "Сколько взбитых сливок идёт на украшения в детском меню ?": {
            "20": False,
            "25": False,
            "30": True
        },
        "На какой напиток не идёт кондитерская посыпка ?": {
            "Детский капучино": True,
            "Шокобум": False,
            "Мадагаскар": False
        },
        "Выбери верный ТТК на детский капучино S": {
            "молоко 200, основа 20, посыпка 1": False,
            "молоко 190, основа 15, посыпка 1": False,
            "молоко 200, основа 15, посыпка 1": True
        },
        "Выбери верный ТТК на детский капучино M": {
            "молоко 300, основа 25, посыпка 1": False,
            "молоко 350, основа 20, посыпка 1": False,
            "молоко 300, основа 20, посыпка 1": True
        },
        "Какая посыпка не идёт в детский капучино?": {
            "темный шоколад": False,
            "брауни лайм": False,
            "песочное печенье": False,
            "малина": False,
            "кориандр": True
        },
        "Какая основа не идёт в детский капучино?": {
            "кленово-ореховый круасан": False,
            "сироп на выбор(WTS)": False,
            "ананас кокос личи": True
        },
        "Какая основа не идёт в мадагаскар?": {
            "топпинг шоколад": False,
            "сироп на выбор(WTS)": False,
            "кленово-ореховый круасан": False,
            "пюре манго": True
        },
        "Сколько молока идёт в мадагаскар ?": {
            "120/160": False,
            "150/200": False,
            "100/150": True
        },
        "Сколько мороженого идёт в мадагаскар ?": {
            "100/150": False,
            "70/120": False,
            "50/100": True
        },
        "Сколько основы идёт в мадагаскар ?": {
            "10/20": False,
            "15/20": False,
            "10/15": True
        },
    },
    "Холодные напитки": {
        "Выбери верный ТТК на милкшейки М": {
            "мол 180, морож 100, осн 20": False,
            "мол 200, морож 120, осн 20": False,
            "мол 180, морож 120, осн 20": True
        },
        "Выбери верный ТТК на милкшейки L": {
            "мол 210, морож 170, осн 25": False,
            "мол 200, морож 160, осн 25": False,
            "мол 210, морож 160, осн 25": True
        },
        "Выбери верный ТТК на милкшейки XL": {
            "мол 250, морож 200, осн 35": False,
            "мол 250, морож 180, осн 30": False,
            "мол 250, морож 200, осн 30": True
        },
        "Какого милкшейка нет в меню ?": {
            "С фисташкой": False,
            "С голубикой асаи и лавандой": False,
            "С манго": False,
            "C лавандой": True
        },
        "Выбери верный ТТК на бамбл М: ": {
            "эсп 30, сок 275, лёд 70, сир 10": False,
            "эсп 30, сок 250, лёд 80, сир 15": False,
            "эсп 30, сок 250, лёд 70, сир 10": True
        },
        "Выбери верный ТТК на бамбл L:": {
            "эсп 60, сок 300, лёд 90, сир 15": False,
            "эсп 60, сок 310, лёд 90, сир 20": False,
            "эсп 60, сок 310, лёд 90, сир 15": True
        },
        "Выбери верный ТТК на бамбл XL:": {
            "эсп 90, сок 370, лёд 100, сир 20": False,
            "эсп 70, сок 370, лёд 110, сир 20": False,
            "эсп 90, сок 370, лёд 110, сир 20": True
        },
        "Сколько тоника идёт в матча-тоник ?:": {
            "180/230/280": False,
            "250/300/350": False,
            "200/250/300": True
        },
        "Сколько матчи идёт в матча-тоник ?:": {
            "3/4/5": False,
            "4/5/6": False,
            "2/3/4": True
        },
        "Сколько льда идёт в матча-тоник ?:": {
            "120/130/150": False,
            "130/160/200": False,
            "120/150/180": True
        },
        "Сколько горячей воды идёт в матча-тоник ?:": {
            "70/90/110": False,
            "30/50/70": False,
            "50/70/90": True
        },
        "Сколько эспрессо идёт в айс раф с сиропом ?:": {
            "30/70": False,
            "30/45": False,
            "30/60": True
        },
        "Сколько молока и сливок идёт в айс раф с сиропом ?:": {
            "100 на M, 175 на L": False,
            "125 на M, 150 на L": False,
            "100 на M, 150 на L": True
        },
        "Сколько сиропа идёт в айс раф с сиропом ?:": {
            "15 на M, 30 на L": False,
            "20 на M, 35 на L": False,
            "20 на M, 30 на L": True
        },
        "Сколько льда идёт в айс раф с сиропом ?:": {
            "120 на M, 150 на L": False,
            "80 на M, 130 на L": False,
            "70 на M, 90 на L": True
        },
        "Выбери верный ТТК на айс какао M:": {
            "мол 290, шок 45, лёд 70": False,
            "мол 250, шок 35, лёд 70": False,
            "мол 250, шок 45, лёд 70": True
        },
        "Выбери верный ТТК на айс какао XL:": {
            "мол 340, шок 80, лёд 100": False,
            "мол 400, шок 80, лёд 120": False,
            "мол 450, шок 80, лёд 120": True
        },
        "Выбери верный ТТК на айс какао L:": {
            "мол 310, шок 65, лёд 90": False,
            "мол 350, шок 70, лёд 90": False,
            "мол 350, шок 65, лёд 90": True
        },
        "Сколько эспрессо идёт в айс-латте лаванда ваниль ?:": {
            "30/45/60": False,
            "30/60/90": False,
            "30/60/70": True
        },
        "Сколько молока идёт в айс-латте лаванда ваниль ?:": {
            "250/310/370": False,
            "225/275/325": False,
            "240/280/320": True
        },
        "Сколько льда идёт в айс-латте лаванда ваниль ?:": {
            "70/90/110": False,
            "80/130/150": False,
            "80/100/120": True
        },
        "Сколько топпинга идёт в айс-латте лаванда ваниль ?:": {
            "20/40/60": False,
            "30/40/50": False,
            "20/30/40": True
        },
        "Сколько сиропа идёт в айс-латте лаванда ваниль ?:": {
            "20/30/40": False,
            "10/20/30": False,
            "10/15/20": True
        },
    },
}
